# coding:utf-8



"""
http://www.52nlp.cn/%E5%A6%82%E4%BD%95%E8%AE%A1%E7%AE%97%E4%B8%A4%E4%B8%AA%E6%96%87%E6%A1%A3%E7%9A%84%E7%9B%B8%E4%BC%BC%E5%BA%A6%E4%B8%89
现在我们就可以通过lsi模型将这门课程映射到10个topic主题模型空间上，然后和其他课程计算相似度：
>>> ml_course = texts[210]
>>> ml_bow = dicionary.doc2bow(ml_course)
>>> ml_lsi = lsi[ml_bow]
>>> print ml_lsi
[(0, 8.3270084238788673), (1, 0.91295652151975082),
(2, -0.28296075112669405), (3, 0.0011599008827843801),
(4, -4.1820134980024255), (5, -0.37889856481054851), (6, 2.0446999575052125),
(7, 2.3297944485200031), (8, -0.32875594265388536), (9, -0.30389668455507612)]
"""










